#### Terraform Format and Style 🖌 `failure`
#### Terraform Initialization ⚙️ `success`
#### Terraform Validation 🤖 
Warning: Attribute is deprecated

  with spectrocloud_cluster_azure.cluster,
  on cluster_azure-picard-1.tf line 18, in resource "spectrocloud_cluster_azure" "cluster":
  18:   cluster_profile_id = spectrocloud_cluster_profile.azure.id

Switch to cluster_profile

(and 3 more similar warnings elsewhere)
Success! The configuration is valid, but there were some validation warnings
as shown above.


#### Terraform Plan 📖 `success`

<details open><summary>Show Plan</summary>

```hcl
terraform
spectrocloud_cluster_profile.prod-gcp: Refreshing state... [id=60994137dba160e4359d13d4]
spectrocloud_cluster_profile.prodvmware: Refreshing state... [id=60994137dba160e43b8ac08f]
spectrocloud_cluster_profile.azure: Refreshing state... [id=60994137dba160e4381dcbca]
spectrocloud_cluster_gcp.cluster: Refreshing state... [id=60c2720b48bda8dad841ad04]
spectrocloud_cluster_azure.cluster: Refreshing state... [id=61a59b1b66f465a306cb6d9b]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # spectrocloud_cluster_vsphere.prod-vmware-1 will be created
  + resource "spectrocloud_cluster_vsphere" "prod-vmware-1" {
      + cloud_account_id   = "609946e4dba160e6c97aa130"
      + cloud_config_id    = (known after apply)
      + cluster_profile_id = "60994137dba160e43b8ac08f"
      + id                 = (known after apply)
      + kubeconfig         = (known after apply)
      + name               = "vmware-prod-1"

      + cloud_config {
          + datacenter            = "Datacenter"
          + folder                = "Demo/spc-prod-vmware-1"
          + network_search_domain = "spectrocloud.local"
          + network_type          = "DDNS"
          + ssh_key               = <<-EOT
                ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQDAUaBODDNpQxJJqXz/Q+afauM5EPFp4oDRrWzK/cGd92N+exkd+tEZdO7n3R+WAx0XTcPiVvfKctzekNS6f/ZMrFb5HAPvFJtnGNIE2sm+eryEnAH+Sc7ppZha3/MaSp/A2dm2IobYRvwl04sEi4w1K+I8Rtt+fBe3gV3wnP3E3yOiRx4G2XFC3T6x8MjdOkjO2v6fBluw1M1H2etp1m/n4D70UkeyVJyipcntz0ubHweU7yPNdNS3YkpExYIGhm97C4dyESHEw9PZVdLs1FBL6mW5Yb4qVbg5FkLljLFynh9jL8IAYal0pibAAH+Sk/Nd4865lVJ3lrm8nhBnjs1OEFA487rcxyInxJk/WwLEHvo88Ku9IlYq15Alr8N/JHHackV4kAH0yJNeLtwAysK2gI7Mb5uGnMTPrz73IZqXSxFqnU34Ow+vwu8fXBtXmHA5cUHyz0ARzpgx8A0e8L8SjdY/6dsFhSzGo7JoCElN7sEMo7iI4Wdo8CYdlT+OXizBf3pnM/wxRZclCeRDJpLtd6jl5swv7J5ocINEh1r3BllCyV8L7Xp5gw8IKT3ohz6rliGJwwlq/emqY52eB3wweTLRm30z3h3aQa3YeAR+2JgvWlrJ3YWsYYCLRhSQTfYmpgUkoZIcfB2xkZzp6cyooM0i5Obz313HsxwBHOmNrw== spectro@spectro
            EOT
          + static_ip             = false
        }

      + machine_pool {
          + control_plane           = false
          + control_plane_as_worker = false
          + count                   = 1
          + name                    = "gpu-basic"
          + update_strategy         = "RollingUpdateScaleOut"

          + instance_type {
              + cpu          = 4
              + disk_size_gb = 65
              + memory_mb    = 8192
            }

          + placement {
              + cluster   = "cluster2"
              + datastore = "Datastore58"
              + id        = (known after apply)
              + network   = "VM Network"
            }
        }
      + machine_pool {
          + control_plane           = false
          + control_plane_as_worker = false
          + count                   = 1
          + name                    = "worker-basic"
          + update_strategy         = "RollingUpdateScaleOut"

          + instance_type {
              + cpu          = 4
              + disk_size_gb = 65
              + memory_mb    = 8192
            }

          + placement {
              + cluster   = "cluster2"
              + datastore = "Datastore58"
              + id        = (known after apply)
              + network   = "VM Network"
            }
        }
      + machine_pool {
          + control_plane           = true
          + control_plane_as_worker = true
          + count                   = 3
          + name                    = "master-pool"
          + update_strategy         = "RollingUpdateScaleOut"

          + instance_type {
              + cpu          = 2
              + disk_size_gb = 61
              + memory_mb    = 4096
            }

          + placement {
              + cluster   = "cluster2"
              + datastore = "Datastore58"
              + id        = (known after apply)
              + network   = "VM Network"
            }
        }

      + pack {
          + name   = "lb-metallb"
          + tag    = "0.8.x"
          + values = <<-EOT
                manifests:
                  metallb:
                
                    #The namespace to use for deploying MetalLB
                    namespace: "metallb-system"
                
                    #MetalLB will skip setting .0 & .255 IP address when this flag is enabled
                    avoidBuggyIps: true
                
                    # Layer 2 config; The IP address range MetalLB should use while assigning IP's for svc type LoadBalancer
                    # For the supported formats, check https://metallb.universe.tf/configuration/#layer-2-configuration
                    addresses:
                    - 10.10.182.10-10.10.182.19
            EOT
        }
    }

  # spectrocloud_cluster_vsphere.prod-vmware-2 will be created
  + resource "spectrocloud_cluster_vsphere" "prod-vmware-2" {
      + cloud_account_id   = "609946e4dba160e6c97aa130"
      + cloud_config_id    = (known after apply)
      + cluster_profile_id = "60994137dba160e43b8ac08f"
      + id                 = (known after apply)
      + kubeconfig         = (known after apply)
      + name               = "vmware-prod-2"

      + cloud_config {
          + datacenter            = "Datacenter"
          + folder                = "Demo/spc-prod-vmware-2"
          + network_search_domain = "spectrocloud.local"
          + network_type          = "DDNS"
          + ssh_key               = <<-EOT
                ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQDAUaBODDNpQxJJqXz/Q+afauM5EPFp4oDRrWzK/cGd92N+exkd+tEZdO7n3R+WAx0XTcPiVvfKctzekNS6f/ZMrFb5HAPvFJtnGNIE2sm+eryEnAH+Sc7ppZha3/MaSp/A2dm2IobYRvwl04sEi4w1K+I8Rtt+fBe3gV3wnP3E3yOiRx4G2XFC3T6x8MjdOkjO2v6fBluw1M1H2etp1m/n4D70UkeyVJyipcntz0ubHweU7yPNdNS3YkpExYIGhm97C4dyESHEw9PZVdLs1FBL6mW5Yb4qVbg5FkLljLFynh9jL8IAYal0pibAAH+Sk/Nd4865lVJ3lrm8nhBnjs1OEFA487rcxyInxJk/WwLEHvo88Ku9IlYq15Alr8N/JHHackV4kAH0yJNeLtwAysK2gI7Mb5uGnMTPrz73IZqXSxFqnU34Ow+vwu8fXBtXmHA5cUHyz0ARzpgx8A0e8L8SjdY/6dsFhSzGo7JoCElN7sEMo7iI4Wdo8CYdlT+OXizBf3pnM/wxRZclCeRDJpLtd6jl5swv7J5ocINEh1r3BllCyV8L7Xp5gw8IKT3ohz6rliGJwwlq/emqY52eB3wweTLRm30z3h3aQa3YeAR+2JgvWlrJ3YWsYYCLRhSQTfYmpgUkoZIcfB2xkZzp6cyooM0i5Obz313HsxwBHOmNrw== spectro@spectro
            EOT
          + static_ip             = false
        }

      + machine_pool {
          + control_plane           = false
          + control_plane_as_worker = false
          + count                   = 2
          + name                    = "test-basic"
          + update_strategy         = "RollingUpdateScaleOut"

          + instance_type {
              + cpu          = 4
              + disk_size_gb = 65
              + memory_mb    = 8192
            }

          + placement {
              + cluster   = "cluster3"
              + datastore = "DSC_3/Datastore59"
              + id        = (known after apply)
              + network   = "VM Network"
            }
        }
      + machine_pool {
          + control_plane           = false
          + control_plane_as_worker = false
          + count                   = 2
          + name                    = "worker-basic"
          + update_strategy         = "RollingUpdateScaleOut"

          + instance_type {
              + cpu          = 4
              + disk_size_gb = 65
              + memory_mb    = 8192
            }

          + placement {
              + cluster   = "cluster3"
              + datastore = "DSC_3/Datastore59"
              + id        = (known after apply)
              + network   = "VM Network"
            }
        }
      + machine_pool {
          + control_plane           = true
          + control_plane_as_worker = true
          + count                   = 1
          + name                    = "master-pool"
          + update_strategy         = "RollingUpdateScaleOut"

          + instance_type {
              + cpu          = 2
              + disk_size_gb = 61
              + memory_mb    = 4096
            }

          + placement {
              + cluster   = "cluster3"
              + datastore = "DSC_3/Datastore59"
              + id        = (known after apply)
              + network   = "VM Network"
            }
        }

      + pack {
          + name   = "lb-metallb"
          + tag    = "0.8.x"
          + values = <<-EOT
                manifests:
                  metallb:
                
                    #The namespace to use for deploying MetalLB
                    namespace: "metallb-system"
                
                    #MetalLB will skip setting .0 & .255 IP address when this flag is enabled
                    avoidBuggyIps: true
                
                    # Layer 2 config; The IP address range MetalLB should use while assigning IP's for svc type LoadBalancer
                    # For the supported formats, check https://metallb.universe.tf/configuration/#layer-2-configuration
                    addresses:
                    - 10.10.182.20-10.10.182.29
            EOT
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Warning: Attribute is deprecated

  with spectrocloud_cluster_azure.cluster,
  on cluster_azure-picard-1.tf line 18, in resource "spectrocloud_cluster_azure" "cluster":
  18:   cluster_profile_id = spectrocloud_cluster_profile.azure.id

Switch to cluster_profile

(and 3 more similar warnings elsewhere)

Warning: Deprecated Attribute

  with spectrocloud_cluster_azure.cluster,
  on cluster_azure-picard-1.tf line 18, in resource "spectrocloud_cluster_azure" "cluster":
  18:   cluster_profile_id = spectrocloud_cluster_profile.azure.id

Switch to cluster_profile

(and 3 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @saamalik, Action: `pull_request`, Working Directory: `sandbox`, Workflow: `Terraform Plan`*